Repository: Ahmedmahmouddd/Customer_support_task
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Home Menu
ar: القائمة الرئيسية

source: Customer Service
ar: خدمة العملاء

source: Help & FAQ
ar: المساعدة والأسئلة الشائعة

source: FAQs
ar: الأسئلة الشائعة

source: Contact Us
ar: تواصل معنا

source: Live Chat
ar: الدردشة المباشرة

source: I am here to assist you
ar: أنا هنا لمساعدتك

source: Hello! I am here to assist you
ar: مرحبًا! أنا هنا لمساعدتك

source: Send a message
ar: أرسل رسالة

source: is required
ar: مطلوب

source: How can we help you?
ar: كيف يمكننا مساعدتك؟

source: Support
ar: الدعم

source: Help center
ar: مركز المساعدة

source: General Information
ar: معلومات عامة

# customerServiceText
source: Need assistance with your account, orders, or anything else? Our customer service team is always ready to help you out promptly and professionally.
ar: تحتاج إلى مساعدة في حسابك أو الطلبات أو أي شيء آخر؟ فريق خدمة العملاء لدينا دائمًا جاهز لمساعدتك بسرعة واحترافية.

source: Profile Picture Upload
ar: رفع صورة الملف الشخصي

source: Profile Picture
ar: صورة الملف الشخصي

# uploadYouProfilePicture
source: Upload your profile picture
ar: قم برفع صورة ملفك الشخصي

source: General
ar: عام

source: Account
ar: الحساب

source: Service
ar: الخدمة

# q1
source: What is this app?
ar: ما هو هذا التطبيق؟

# a1
source: This app helps you connect with customer support quickly and easily.
ar: هذا التطبيق يساعدك على التواصل مع دعم العملاء بسرعة وسهولة.

# q2
source: How do I contact support?
ar: كيف يمكنني التواصل مع الدعم؟

# a2
source: You can use the live chat or send us a message via the Contact Us section.
ar: يمكنك استخدام الدردشة المباشرة أو إرسال رسالة من خلال قسم تواصل معنا.

# q3
source: Is support available 24/7?
ar: هل الدعم متاح على مدار الساعة؟

# a3
source: Yes, our support team is available around the clock.
ar: نعم، فريق الدعم لدينا متاح على مدار 24 ساعة.

# q4
source: Do I need an account to use support?
ar: هل أحتاج إلى حساب لاستخدام الدعم؟

# a4
source: No, you can access general help without logging in.
ar: لا، يمكنك الوصول إلى المساعدة العامة دون تسجيل الدخول.

# q5
source: How do I reset my password?
ar: كيف أعيد تعيين كلمة المرور؟

# a5
source: Go to Settings > Account > Reset Password and follow the instructions.
ar: اذهب إلى الإعدادات > الحساب > إعادة تعيين كلمة المرور واتبع التعليمات.

# q6
source: How do I update my profile?
ar: كيف أُحدّث ملفي الشخصي؟

# a6
source: Navigate to your profile and tap Edit to update your information.
ar: انتقل إلى ملفك الشخصي واضغط على تعديل لتحديث المعلومات.

# q7
source: Can I change my email address?
ar: هل يمكنني تغيير بريدي الإلكتروني؟

# a7
source: Yes, you can update it in your account settings.
ar: نعم، يمكنك تحديثه من إعدادات الحساب.

# q8
source: How do I delete my account?
ar: كيف يمكنني حذف حسابي؟

# a8
source: Please contact support to request account deletion.
ar: يرجى التواصل مع الدعم لطلب حذف الحساب.

# q9
source: How do I track my service request?
ar: كيف أتابع طلب الخدمة الخاص بي؟

# a9
source: Go to the Services section to see status and updates.
ar: اذهب إلى قسم الخدمات للاطلاع على الحالة والتحديثات.

# q10
source: Can I cancel a request after submitting?
ar: هل يمكنني إلغاء الطلب بعد إرساله؟

# a10
source: Yes, you can cancel it from the request details page.
ar: نعم، يمكنك إلغاؤه من صفحة تفاصيل الطلب.

# q11
source: What types of services are supported?
ar: ما هي أنواع الخدمات المتوفرة؟

# a11
source: We support account help, technical support, and order inquiries.
ar: ندعم المساعدة في الحساب، والدعم الفني، واستفسارات الطلبات.

# q12
source: How long does it take to get a response?
ar: كم من الوقت يستغرق الحصول على رد؟

# a12
source: Usually within a few minutes via live chat, or up to 24 hours via email.
ar: عادةً خلال بضع دقائق عبر الدردشة، أو حتى 24 ساعة عبر البريد الإلكتروني.

source: Call
ar: إتصال

source: GitHub
ar: جيتهاب

source: linkedIn
ar: لينكدان

source: Whatsapp
ar: واتساب

source: Camera
ar: كاميرا

source: Gallery
ar: المعرض

source: search
ar: بحث
